
// Модуль Объекта



Процедура ОбработкаПроведения(Отказ, Режим)
	
	
	
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.СтоимостьМатериалов.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	
	//  В ОДНОМ Цикле обходим ТЧ для ТРЁХ РН
	Для Каждого ТекСтрокаПереченьНоменклатуры Из ПереченьНоменклатуры Цикл   
		
		// РН Остатки 
		// через ТОЧКУ проверяем ВИД Номенклатуры
		Если ТекСтрокаПереченьНоменклатуры.Номенклатура.ВидНоменклатуры = 
			Перечисления.ВидыНоменклатуры.Материал Тогда
			
			// регистр ОстаткиМатериалов Расход	
			Движение = Движения.ОстаткиМатериалов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Материал = ТекСтрокаПереченьНоменклатуры.Номенклатура;
			Движение.Склад = Склад;
			Движение.Количество = ТекСтрокаПереченьНоменклатуры.Количество;
			
			// регистр СтоимостьМатериалов Расход
			Движение = Движения.СтоимостьМатериалов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Материал = ТекСтрокаПереченьНоменклатуры.Номенклатура;
			Движение.Стоимость = ТекСтрокаПереченьНоменклатуры.Количество * 
			ТекСтрокаПереченьНоменклатуры.Стоимость;
			
		КонецЕсли;   
		
		// Регистр Продажи 
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаПереченьНоменклатуры.Номенклатура;
		Движение.Клиент = Клиент;
		Движение.Мастер = Мастер;
		Движение.Количество = ТекСтрокаПереченьНоменклатуры.Количество;
		Движение.Выручка = ТекСтрокаПереченьНоменклатуры.Сумма;
		Движение.Стоимость = ТекСтрокаПереченьНоменклатуры.Стоимость * 
		ТекСтрокаПереченьНоменклатуры.Количество  
		
	КонецЦикла;
	
	
КонецПроцедуры
