
// Модуль Объекта


Процедура ОбработкаПроведения(Отказ, Режим)
	
	
	
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.СтоимостьМатериалов.Записывать = Истина;
	
	//  В ОДНОМ Цикле обходим ТЧ для ДВУХ РН
	Для Каждого ТекСтрокаПереченьНоменклатуры Из ПереченьНоменклатуры Цикл   
		
		// через ТОЧКУ проверяем ВИД Номенклатуры
		Если ТекСтрокаПереченьНоменклатуры.Номенклатура.ВидНоменклатуры = 
			Перечисления.ВидыНоменклатуры.Материал Тогда
			
			// регистр ОстаткиМатериалов Расход	
			Движение = Движения.ОстаткиМатериалов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Материал = ТекСтрокаПереченьНоменклатуры.Номенклатура;
			Движение.Склад = Склад;
			Движение.Количество = ТекСтрокаПереченьНоменклатуры.Количество;
			
			// регистр СтоимостьМатериалов Расход
			Движение = Движения.СтоимостьМатериалов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Материал = ТекСтрокаПереченьНоменклатуры.Номенклатура;
			Движение.Стоимость = ТекСтрокаПереченьНоменклатуры.Количество * 
			ТекСтрокаПереченьНоменклатуры.Стоимость;
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры
