
// Модуль Объекта

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ОстаткиМатериалов Расход
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаПереченьНоменклатуры Из ПереченьНоменклатуры Цикл   
		
		// через ТОЧКУ проверяем ВИД Номенклатуры
		Если ТекСтрокаПереченьНоменклатуры.Номенклатура.ВидНоменклатуры = 
			Перечисления.ВидыНоменклатуры.Материал Тогда 
			
			Движение = Движения.ОстаткиМатериалов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Материал = ТекСтрокаПереченьНоменклатуры.Номенклатура;
			Движение.Склад = Склад;
			Движение.Количество = ТекСтрокаПереченьНоменклатуры.Количество; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры